# CurvesUnlooped Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..CurvesUnlooped Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
Segments defining the Rebar Shape must be in a continuous loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurvesUnlooped { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurvesUnlooped As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurvesUnlooped {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace